#主过程
def main():
    # 获取当前微信客户端
    # 获取会话列表
    # wx.GetSessionList()
    me = "任德龙"
    wx._show
    #wx.ChatWith("任德龙律师")    # 输出当前聊天窗口聊天消息
    msgs = wx.GetAllMessage()#先读取一次聊天记录,返回列表
    lastmsgid2 = msgs[-1][-1] if msgs else None#记录最后一条聊天记录的id
    while True:
        msgs = wx.GetNextNewMessage2(lastmsgid=lastmsgid2,savepic=False)#读取最新聊天记录
        if msgs is not None:
            # lastmsgid2 = msgs[-1][-1] if msgs else None#更新最后一条聊天记录的id
            for who, new_msgs in msgs.items():
                lastmsgid2 = msgs[who][-1][-1] #更新最后一条聊天记录的id
                print(f"New messages for {who}:")
                for msg in new_msgs:
                    print(f"{msg[0]}: {msg[1]}")
                    if msg[0]!="SYS" and msg[0]!=me:
                        GetReply(msg[1])
        time.sleep(5)





ls= [1,2,3,4,5,6,7,8,9,10]
print(ls[:])
print(ls[:-1])



msgs_ = [['SYS', '查看更多消息', '422000424292'], ['Time', '昨天 14:38', '422000424293'], ['清易', '？', '422000424288'], ['Time', '昨天 14:56', '422000424294'], ['数据运营 陈秋元', '听', '422000424285'], ['数据运营 陈秋元', '好', '422000424282'], ['Time', '昨天 15:31', '422000424295'], ['数据运营 陈秋元', '是', '422000424279'], ['清易', '收到', '422000424273'], ['数据运营 陈秋元', '啊？', '422000424270'], ['清易', '收到', '422000424264'], ['清易', '收到', '422000424258'], ['清易', '收到', '422000424252'], ['清易', '收到', '422000424246'], ['Time', '昨天 15:43', '422000424296'], ['数据运营 陈秋元', '没', '422000424243'], ['数据运营 陈秋元', '我', '422000424240'], ['清易', '测试', '422000424234'], ['清易', '有', '422000424228'], ['Time', '昨天 15:59', '422000424297'], ['数据运营 陈秋元', '师', '422000424225'], ['Time', '昨天 16:23', '422000424298'], ['数据运营 陈秋元', '得', '422000424222'], ['数据运营 陈秋元', '你', '422000424219'], ['数据运营 陈秋元', '的', '422000424216'], ['数据运营 陈秋元', '测试', '422000424118'], ['Time', '昨天 16:42', '422000424142'], ['数据运营 陈秋元', '小', '422000424115'], ['Time', '昨天 17:05', '422000424143'], ['数据运营 陈秋元', '你', '422000424112'], ['Time', '昨天 17:16', '422000424144'], ['数据运营 陈秋元', '我', '422000424109'], ['数据运营 陈秋元', '你', '422000424106'], ['Time', '9:41', '422000424145'], ['数据运营 陈秋元', '测试', '422000424103'], ['清易', '收到', '42200042497'], ['清易', '收到', '42200042491'], ['清易', '收到', '42200042485'], ['数据运营 陈秋元', '好', '42200042482'], ['数据运营 陈秋元', '测试', '42200042479'], ['清易', '收到', '42200042473']]
print(msgs_[:-1])
print([i[-1] for i in msgs_[:-1]])
print([i[-1] for i in msgs_].index('422000424292'))
